app/views/shared/_usuario_info.html.erb

<span>
  <%= pluralize(current_usuario.microvideos.count, "microvideo") %>
---
SELECT COUNT(*) FROM "microvideos" WHERE "microvideos"."usuario_id" = ?  [["usuario_id", 1]]