app/views/usuarios/show.html.erb

  <div class="span4">
    <% if @usuario.microvideos.any? %>
---
SELECT 1 AS one FROM "microvideos" WHERE "microvideos"."usuario_id" = ? ORDER BY created_at DESC LIMIT 1  [[nil, 1]]