app/controllers/microvideos_controller.rb

  def create
    @microvideo = current_usuario.microvideos.build(microvideo_params)
    if @microvideo.save
---
INSERT INTO "microvideos" ("content", "created_at", "updated_at", "usuario_id") VALUES (?, ?, ?, ?)  [["content", "http://www.youtube.com/watch?v=_rxgp7TJhUE"], ["created_at", Sun, 15 Dec 2013 22:02:02 UTC +00:00], ["updated_at", Sun, 15 Dec 2013 22:02:02 UTC +00:00], ["usuario_id", 1]]