app/controllers/usuarios_controller.rb

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? ORDER BY "usuarios"."id" ASC LIMIT 1  [["id", 1]]
SELECT "microvideos".* FROM "microvideos" WHERE "microvideos"."usuario_id" = ? ORDER BY created_at DESC LIMIT 30 OFFSET 0  [["usuario_id", 1]]
SELECT COUNT(*) FROM "microvideos" WHERE "microvideos"."usuario_id" = ?  [["usuario_id", 1]]
---
  def show
    @usuario = Usuario.find(params[:id])
    @microvideos = @usuario.microvideos.paginate(page: params[:page])

INSERT INTO "usuarios" ("created_at", "email", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @usuario = Usuario.new(user_params)    # Not the final implementation!
    if @usuario.save

DELETE FROM "usuarios" WHERE "usuarios"."id" = ?  [["id", 7]]
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", "7"]]
---
  def destroy
    Usuario.find(params[:id]).destroy

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @usuario = Usuario.find(params[:id])

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "usuarios" SET "name" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "usuarios"."id" = 1  [["name", "Manolo"], ["email", "manolo@example.com"], ["password_digest", "$2a$04$gHt3voH.IIq3lVETSLDk9.P/6RQ/88NBqiCvbctONrimXxG9SoCC6"], ["updated_at", Thu, 19 Dec 2013 10:01:37 UTC +00:00]]
---
  def update
    @usuario = Usuario.find(params[:id])
    if @usuario.update_attributes(user_params)

SELECT "usuarios".* FROM "usuarios" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "usuarios"
---
  def index
    @usuarios = Usuario.paginate(page: params[:page])

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", "1"]]
---
  def following
    @title = "Following"
    @usuario = Usuario.find(params[:id])

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", "1"]]
---
  def followers
    @title = "Followers"
    @usuario = Usuario.find(params[:id])